In [1]:
%config Completer.use_jedi = False

In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [6]:
data

a  1   -1.188388
   2   -0.176550
   3    0.168387
b  1   -0.932488
   3    0.729359
c  1    0.072929
   2    1.014665
d  2    0.722294
   3    0.908110
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1   -0.932488
3    0.729359
dtype: float64

In [10]:
data.unstack().stack()

a  1   -1.188388
   2   -0.176550
   3    0.168387
b  1   -0.932488
   3    0.729359
c  1    0.072929
   2    1.014665
d  2    0.722294
   3    0.908110
dtype: float64

In [13]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names = ['key1', 'key2']

In [16]:
frame.columns.names = ['state', 'color']

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## Combining and Merging Datasets

In [19]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                   'data1' : range(7)})

In [20]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [21]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 
                   'data2' : range(3)})

In [22]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [24]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [25]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1' : range(7)})

In [26]:
df4 = pd.DataFrame({'rkey' : ['a', 'b', 'd'], 
                   'data2' : range(3)})

In [27]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0